MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK21DX128AVLK5/mcu.h
#define TOT                           0x04000000      // -
#define TOTR                          0x02000000      // -
#define FXOR                          0x01000000      // -
#define WAS                           0x00800000      // -
#define TCRC                          0x00400000      // -


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CASR register.
//
//*****************************************************************************

#define CAU Version                   0x780000000      // Indicates CAU version.
#define DES Parity Error              0x00000002      // Indicates whether the DES parity error is detected.
#define Illegal Command               0x00000001      // Indicates an illegal instruction has been executed.


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CAA register.
//
//*****************************************************************************

#define Accumulator                   0x7FFFFFFF80000000      // Stores results of various CAU commands.


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CAn register.
//
//*****************************************************************************

#define General Purpose Registers     0x7FFFFFFF80000000      // Used by the CAU commands. Some cryptographic operations work with specific registers.


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_SR register.
//
//*****************************************************************************

#define OREG_SIZE                     0x7F800000      // Indicates the size of the Output (OR) register in terms of the number of 32-bit random-data words it can hold.
#define OREG_LVL                      0x007F8000      // Indicates the number of random-data words that are in OR[RANDOUT], which indicates whether OR[RANDOUT] is valid.
#define SLP                           0x00000010      // Specifies whether RNGA is in Sleep or Normal mode.
#define ERRI                          0x00000008      // Indicates whether an OR underflow condition has occurred since you last cleared the error interrupt (CR[CLRI]) or RNGA was reset, regardless of whether the error interrupt is masked (CR[INTM]).
#define ORU                           0x00000004      // Indicates whether an OR underflow condition has occurred since you last read this register (SR) or RNGA was reset, regardless of whether the error interrupt is masked (CR[INTM]).
#define LRS                           0x00000002      // Indicates whether the most recent read of OR[RANDOUT] caused an OR underflow condition, regardless of whether the error interrupt is masked (CR[INTM]).
#define SECV                          0x00000001      // Used only when high assurance is enabled (CR[HA]). Indicates that a security violation has occurred.


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_ER register.
//
//*****************************************************************************

#define EXT_ENT                       0x7FFFFFFF80000000      // Specifies an entropy value that RNGA uses in addition to its ring oscillators to seed its pseudorandom algorithm.


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_OR register.
//
//*****************************************************************************

#define RANDOUT                       0x7FFFFFFF80000000      // Stores a random-data word generated by RNGA. This is a read-only field. ::


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC1n register.
//
//*****************************************************************************

#define COCO                          0x00000080      // Conversion Complete Flag
#define AIEN                          0x00000040      // Interrupt Enable
#define DIFF                          0x00000020      // Differential Mode Enable
#define ADCH                          0x000001F0      // Input channel select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CFG1 register.
//
//*****************************************************************************

#define ADLPC                         0x00000080      // Low-Power Configuration
#define ADIV                          0x000000C0      // Clock Divide Select
#define ADLSMP                        0x00000010      // Sample Time Configuration
#define MODE                          0x00000018      // Conversion mode selection
#define ADICLK                        0x00000006      // Input Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CFG2 register.
//
//*****************************************************************************

#define MUXSEL                        0x00000010      // ADC Mux Select
#define ADACKEN                       0x00000008      // Asynchronous Clock Output Enable
#define ADHSC                         0x00000004      // High-Speed Configuration
#define ADLSTS                        0x00000006      // Long Sample Time Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_Rn register.
//
//*****************************************************************************

#define D                             0x7FFF8000      // Data result ::


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CVn register.
//
//*****************************************************************************

