MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK21DX128AVLK5/mcu.h
#define TPR                           0x7FFF8000      // Time Prescaler Register
#define Reserved                      0x7FFF80000000      // This field is reserved.


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_TAR register.
//
//*****************************************************************************

#define TAR                           0x7FFFFFFF80000000      // Time Alarm Register


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_TCR register.
//
//*****************************************************************************

#define CIC                           0x7F80000000      // Compensation Interval Counter
#define TCV                           0x7F800000      // Time Compensation Value
#define CIR                           0x007F8000      // Compensation Interval Register
#define TCR                           0x00007F80      // Time Compensation Register


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_CR register.
//
//*****************************************************************************

#define SC2P                          0x00002000      // Oscillator 2pF Load Configure
#define SC4P                          0x00001000      // Oscillator 4pF Load Configure
#define SC8P                          0x00000800      // Oscillator 8pF Load Configure
#define SC16P                         0x00000400      // Oscillator 16pF Load Configure
#define CLKO                          0x00000200      // Clock Output
#define OSCE                          0x00000100      // Oscillator Enable
#define UM                            0x00000008      // Update Mode
#define SUP                           0x00000004      // Supervisor Access
#define WPE                           0x00000002      // Wakeup Pin Enable
#define SWR                           0x00000001      // Software Reset


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_SR register.
//
//*****************************************************************************

#define TCE                           0x00000010      // Time Counter Enable
#define MOF                           0x00000008      // Monotonic Overflow Flag
#define TAF                           0x00000004      // Time Alarm Flag
#define TOF                           0x00000002      // Time Overflow Flag
#define TIF                           0x00000001      // Time Invalid Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_LR register.
//
//*****************************************************************************

#define MCHL                          0x00000800      // Monotonic Counter High Lock
#define MCLL                          0x00000400      // Monotonic Counter Low Lock
#define MEL                           0x00000200      // Monotonic Enable Lock
#define TTSL                          0x00000100      // Tamper Time Seconds Lock
#define Reserved                      0x00000080      // This field is reserved.
#define LRL                           0x00000040      // Lock Register Lock
#define SRL                           0x00000020      // Status Register Lock
#define CRL                           0x00000010      // Control Register Lock
#define TCL                           0x00000008      // Time Compensation Lock


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_IER register.
//
//*****************************************************************************

#define WPON                          0x00000080      // Wakeup Pin On
#define TSIE                          0x00000010      // Time Seconds Interrupt Enable
#define MOIE                          0x00000008      // Monotonic Overflow Interrupt Enable
#define TAIE                          0x00000004      // Time Alarm Interrupt Enable
#define TOIE                          0x00000002      // Time Overflow Interrupt Enable
#define TIIE                          0x00000001      // Time Invalid Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_TTSR register.
//
//*****************************************************************************

#define TTS                           0x7FFFFFFF80000000      // Tamper Time Seconds


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_MER register.
//
//*****************************************************************************

#define MCE                           0x00000010      // Monotonic Counter Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_MCLR register.
//
//*****************************************************************************

#define MCL                           0x7FFFFFFF80000000      // Monotonic Counter Low


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_MCHR register.
//
//*****************************************************************************

#define MCH                           0x7FFFFFFF80000000      // Monotonic Counter High


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_WAR register.
//
//*****************************************************************************

#define MCHW                          0x00000800      // Monotonic Counter High Write
#define MCLW                          0x00000400      // Monotonic Counter Low Write
#define MERW                          0x00000200      // Monotonic Enable Register Write
#define TTSW                          0x00000100      // Tamper Time Seconds Write
#define IERW                          0x00000080      // Interrupt Enable Register Write
#define LRW                           0x00000040      // Lock Register Write
#define SRW                           0x00000020      // Status Register Write
#define CRW                           0x00000010      // Control Register Write
#define TCRW                          0x00000008      // Time Compensation Register Write
#define TARW                          0x00000004      // Time Alarm Register Write
#define TPRW                          0x00000002      // Time Prescaler Register Write
#define TSRW                          0x00000001      // Time Seconds Register Write


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_RAR register.
//
//*****************************************************************************

#define MCHR                          0x00000800      // Monotonic Counter High Read


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_PERID register.
//
//*****************************************************************************

#define ID                            0x000007E0      // Peripheral Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_IDCOMP register.
//
//*****************************************************************************

#define NID                           0x000007E0      // Ones' complement of PERID[ID]


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_REV register.
//
//*****************************************************************************

#define REV                           0x00007F80      // Revision


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ADDINFO register.
//
//*****************************************************************************

#define IEHOST                        0x00000001      // Host mode enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGISTAT register.
//
//*****************************************************************************

