MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK21DX128AVLK5/mcu.h
#define WFP                           0x00780000      // Write FIFO Pointer
#define RFP                           0x00000078      // Read FIFO Pointer


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RMR register.
//
//*****************************************************************************

#define RWM                           0x7FFF8000      // Receive Word Mask


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_MCR register.
//
//*****************************************************************************

#define DUF                           0x80000000      // Divider Update Flag
#define MOE                           0x40000000      // MCLK Output Enable
#define MICS                          0x06000000      // MCLK Input Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_MDR register.
//
//*****************************************************************************

#define FRACT                         0x07F80000      // MCLK Fraction
#define DIVIDE                        0x007FF800      // MCLK Divide ::


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDOR register.
//
//*****************************************************************************

#define PDO                           0x7FFFFFFF80000000      // Port Data Output Register bits for unbonded pins return a undefined value when read.


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PSOR register.
//
//*****************************************************************************

#define PTSO                          0x7FFFFFFF80000000      // Port Set Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PCOR register.
//
//*****************************************************************************

#define PTCO                          0x7FFFFFFF80000000      // Port Clear Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PTOR register.
//
//*****************************************************************************

#define PTTO                          0x7FFFFFFF80000000      // Port Toggle Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDIR register.
//
//*****************************************************************************

#define PDI                           0x7FFFFFFF80000000      // Port Data Input


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDDR register.
//
//*****************************************************************************

#define PDD                           0x7FFFFFFF80000000      // Port Data Direction


//*****************************************************************************
//
// The following are defines for the bit fields in the Flash_Configuration_Field_Description register.
//
//*****************************************************************************

#define Backdoor Comparison Key       0x00007F80      // Backdoor Comparison Key
#define Program flash protection bytes0x00007800      // Program flash protection bytes
#define Program flash only devices: Reserved FlexNVM devices: Data flash protection byte0x00001000      // Program flash only devices: Reserved FlexNVM devices: Data flash protection byte
#define Program flash only devices: Reserved FlexNVM devices: EEPROM protection byte0x00002000      // Program flash only devices: Reserved FlexNVM devices: EEPROM protection byte
#define Flash nonvolatile option byte 0x00004000      // Flash nonvolatile option byte
#define Flash security byte           0x00008000      // Flash security byte


//*****************************************************************************
//
// The following are defines for the bit fields in the Program_Flash_IFR_Map register.
//
//*****************************************************************************

#define Program Once Field            0x7FFFFFFFFFFFFFFF8000000000000000000000000000000000000000000000000000000000000000      // Program Once Field


//*****************************************************************************
//
// The following are defines for the bit fields in the Program_Once_Field register.
//
//*****************************************************************************

#define Program Once Field            0x7FFFFFFFFFFFFFFF8000000000000000      // Program Once Field


//*****************************************************************************
//
// The following are defines for the bit fields in the Data_Flash_IFR_Map register.
//
//*****************************************************************************

#define EEPROM data set size          0x2000000000000000000000000000000000000000000000000000000000000000      // EEPROM data set size
#define FlexNVM partition code        0x1000000000000000000000000000000000000000000000000000000000000000      // FlexNVM partition code


//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_Data_Set_Size register.
//
//*****************************************************************************

#define EEESPLIT                      0x00000180      // EEPROM Split Factor — Determines the relative sizes of the two EEPROM subsystems
#define EEESIZE                       0x00000078      // EEPROM Size — Encoding of the total available FlexRAM for EEPROM use


//*****************************************************************************
//
// The following are defines for the bit fields in the FlexNVM_Partition_Code register.
//
//*****************************************************************************

